In [3]:
import pandas as pd
df1=pd.DataFrame({'A':[1,2,3,0],
                  'B':[3,5,6,7]})

In [4]:
df1

   A  B
0  1  3
1  2  5
2  3  6
3  0  7

In [5]:
df2=pd.DataFrame({'C':[9,8,7],
                  'D':[7,8,6]})

In [6]:
df2

   C  D
0  9  7
1  8  8
2  7  6

In [9]:
df3=df1.join(df2,how='left')

In [10]:
df3

   A  B    C    D
0  1  3  9.0  7.0
1  2  5  8.0  8.0
2  3  6  7.0  6.0
3  0  7  NaN  NaN

In [12]:
total = df3.isnull()
total

       A      B      C      D
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True   True

In [14]:
total = df3.isnull().sum().sort_values(ascending=False)
total

D    1
C    1
B    0
A    0
dtype: int64

In [17]:
df3.isnull().any()

A    False
B    False
C     True
D     True
dtype: bool